<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<title>
</title>
<meta http-equiv="Content-Type" content="text/html;charset=windows-1251">
</head>
<body background="../FON.JPG" BGCOLOR="#E7E3E7" TEXT="#000000" LINK="#004080" VLINK="#004080">
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index11.htm">
<img SRC="Back.gif" BORDER="0" width="73" height="22">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0" width="73" height="22">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index13.htm">
<img SRC="For.gif" BORDER="0" width="73" height="22">
</a>
</font>
</td>
</tr>
</table>
<p>
&nbsp;
</p>
<p align="center">
<font face="Arial, Helvetica, sans-serif" size="3">
<font size="4">
INT &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; 
</font>
<br>
</font>
</p>
<p align="left">
<font face="Arial, Helvetica, sans-serif" size="3">
  &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; hit &#1080;&#1085;&#1080;&#1094;&#1080;&#1080;&#1088;&#1091;&#1077;&#1090; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; 
  &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084;
n, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1074; 
  &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; int. &#1042; &#1089;&#1090;&#1077;&#1082; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1079;&#1072;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; 
  &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;, &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; CS &#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;
IP, &#1087;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1074; 
  &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; IP &#1080; CS &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1076;&#1074;&#1091;&#1093; &#1089;&#1083;&#1086;&#1074; &#1080;&#1079; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084; 
  n (&#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084; 0:n*4 &#1080; 0:n*4+2). &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075;&#1080; IF &#1080; 
  TF &#1074; 0. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; iret, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; 
  &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;.</p>
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1</b>
  </p>
<blockquote>
<p><br>

</font>
  <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  int 60h ;&#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1085;&#1072; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1086;&#1081;<br>
  ;&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; 60h<br>
  </font>
  </p>
</blockquote>
<font face="Arial, Helvetica, sans-serif" size="3">
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2</b>
  </p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  mov AH,1 ;&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; MS-DOS - &#1074;&#1074;&#1086;&#1076; &#1089;<br>
  ;&#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1082;&#1086;&#1076;&#1072; ASCII &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; <br>
  int 2h ;&#1042;&#1099;&#1079;&#1086;&#1074; MS-DOS</font>
<font face="Arial, Helvetica, sans-serif" size="3">
  <br>
  </p>
  </blockquote>
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3</b></p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  mov &#1040;&#1053;, 0 ;&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; BIOS (&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; <br>
  ;16h) - &#1074;&#1074;&#1086;&#1076; &#1089; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; <br>
  ;&#1082;&#1086;&#1076;&#1072; ASCII &#1080; &#1089;&#1082;&#1077;&#1085;-&#1082;&#1086;&#1076;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;<br>
  int 16h ;&#1042;&#1099;&#1079;&#1086;&#1074; BIOS</font></p>
<p>&nbsp;</p>
</blockquote>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="4">INTO &#1055;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; 
  &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1102;</font></p>
<font face="Arial, Helvetica, sans-serif" size="3">
<p><br>
  &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; into, &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1074;&#1089;&#1083;&#1077;&#1076; &#1079;&#1072; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;, &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; 
  &#1080;&#1083;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088; 4, &#1077;&#1089;&#1083;&#1080; 
  &#1087;&#1088;&#1077;&#1076;&#1096;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1072; &#1092;&#1083;&#1072;&#1075; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;
OF. &#1055;&#1077;&#1088;&#1077;&#1076; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; 
  &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; INTO &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; 4 &#1076;&#1074;&#1091;&#1093;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1081; 
  &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1074;&#1086;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1102;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; 
  &#1092;&#1083;&#1072;&#1075;&#1080; IF &#1080; TF &#1074; 0. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; iret, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, 
  &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;.</p>
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;</b></p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  add AX,BX ;&#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <br>
  into ;&#1042;&#1099;&#1079;&#1086;&#1074; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1086;&#1075;&#1086;<br>
  ;&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088; 4,<br>
  ;&#1077;&#1089;&#1083;&#1080; OF=1 <br>
  ... ;&#1055;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1077;&#1089;&#1083;&#1080; OF=0</font></p>
<p>&nbsp;</p>
</blockquote>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="4">IRET &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; 
  &#1080;&#1079; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;</font></p>
<font face="Arial, Helvetica, sans-serif" size="3">
<p><br>
  &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; iret &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; 
  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1091;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1090;&#1088;&#1080; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072; 
  &#1080; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1080;&#1093; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; IP, CS &#1080; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; (&#1089;&#1084;. &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;
int). &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; iret &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; 
  &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1090;&#1100;&#1089;&#1103; &#1083;&#1102;&#1073;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;, &#1082;&#1072;&#1082; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093; (&#1086;&#1090; 
  &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; int). &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1085;&#1077; &#1074;&#1086;&#1079;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1072; &#1092;&#1083;&#1072;&#1075;&#1080;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1086;&#1085;&#1072; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; 
  &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1077;&#1075;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1073;&#1099;&#1083;&#1086; &#1090;&#1072;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084; 
  &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1080;&#1079; 
  &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; iret &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1092;&#1083;&#1072;&#1075;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; 
  &#1073;&#1099;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; (&#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1077;&#1084;), &#1080;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091; 
  &#1085;&#1072;&#1076;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1074; &#1082;&#1086;&#1087;&#1080;&#1080; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077;.</p>
<p>&nbsp;</p>

</font>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="4">386+ IRETD</font></p>
<font face="Arial, Helvetica, sans-serif" size="3">
<p><br>
  &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1080;&#1079; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; 32-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;<br>
  &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; iretd &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1076;&#1083;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1080;&#1079; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; 
  &#1080;&#1083;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1091;&#1102; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;. &#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; 16-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1081; 
  &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; iret, &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;, &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;, 
  &#1089;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1072; 3 &#1076;&#1074;&#1086;&#1081;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1074;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;
EFALGS, 
  CS &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; EIP. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; iretd 
  &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1079;&#1072;&#1076;&#1072;&#1095; - &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1102;&#1097;&#1077;&#1081;&#1089;&#1103; 
  &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1074; &#1077;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1080;&#1079; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; 
  &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;.</p>
<p>&nbsp;</p>

</font>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="4">Jcc &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
  &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074;</font></p>
<font face="Arial, Helvetica, sans-serif" size="3">
<p><br>
  &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1084;&#1099;&#1077; (&#1074; &#1082;&#1085;&#1080;&#1075;&#1072;&#1093;, &#1085;&#1077; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093;!)
Jcc, &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1102;&#1090; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; 
  &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1085;&#1077;&#1084;&#1086;&#1085;&#1080;&#1082;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1045;&#1089;&#1083;&#1080; 
  &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1085;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1085;&#1077; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;, 
  &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1079;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; Jcc. &#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1074;&#1087;&#1077;&#1088;&#1077;&#1076;, &#1090;&#1072;&#1082; &#1080; &#1085;&#1072;&#1079;&#1072;&#1076; 
  &#1074; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1077; + 127...-128 &#1073;&#1072;&#1081;&#1090;&#1086;&#1074;.<br>
  &#1042; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074;:</p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1055;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1059;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072;<br>
  ja &#1074;&#1099;&#1096;&#1077; CF=0 &#1080; ZF=0<br>
  jae &#1074;&#1099;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1086; CF=0<br>
  jb &#1085;&#1080;&#1078;&#1077; CF=1<br>
  jbe &#1085;&#1080;&#1078;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1086; CF=1 &#1080;&#1083;&#1080; ZF=1<br>
  jc &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; CF=1<br>
  jcxz CX=0 CX=0<br>
  je &#1088;&#1072;&#1074;&#1085;&#1086; ZF=1<br>
  jg &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; ZF=0 &#1080;&#1083;&#1080; SF=OF<br>
  jge &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1086; SF=OF<br>
  jl &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; SF &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; OF<br>
  jle &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1086; ZF=1 &#1080;&#1083;&#1080; SF &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; OF<br>
  jna &#1085;&#1077; &#1074;&#1099;&#1096;&#1077; CF=1 &#1080;&#1083;&#1080; ZF=1<br>
  jnae &#1085;&#1077; &#1074;&#1099;&#1096;&#1077; &#1080; &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; CF=1<br>
  jnb &#1085;&#1077; &#1085;&#1080;&#1078;&#1077; CF=0<br>
  jnbe &#1085;&#1077; &#1085;&#1080;&#1078;&#1077; &#1080; &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; CF=0 &#1080; ZF=0<br>
  jnc &#1085;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; CF=0<br>
  jne &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; ZF=0<br>
  jng &#1085;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; ZF=1 &#1080;&#1083;&#1080; SF &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; OF<br>
  jnge &#1085;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080; &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; SF &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; OF<br>
  jnl &#1085;&#1077; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; SF=OF<br>
  jnle &#1085;&#1077; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1080; &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; ZF=0 &#1080; SF=OF<br>
  jno &#1085;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; OF=0<br>
  jnp &#1085;&#1077;&#1090; &#1095;&#1077;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; PF=0<br>
  jns &#1079;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1081; &#1073;&#1080;&#1090; &#1088;&#1072;&#1074;&#1077;&#1085; &#1054; SF=0<br>
  jnz &#1085;&#1077; &#1085;&#1091;&#1083;&#1100; ZF=0<br>
  jo &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; OF=1<br>
  jp &#1077;&#1089;&#1090;&#1100; &#1095;&#1077;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; PF=1<br>
  jpe &#1089;&#1091;&#1084;&#1084;&#1072; &#1073;&#1080;&#1090;&#1086;&#1074; &#1095;&#1077;&#1090;&#1085;&#1072;&#1103; PF=1<br>
  jpo &#1089;&#1091;&#1084;&#1084;&#1072; &#1073;&#1080;&#1090;&#1086;&#1074; &#1085;&#1077;&#1095;&#1077;&#1090;&#1085;&#1072;&#1103; PF=0<br>
  js &#1079;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1081; &#1073;&#1080;&#1090; &#1088;&#1072;&#1074;&#1077;&#1085; SF=1<br>
  jz &#1085;&#1091;&#1083;&#1100; ZF= I</font></p>
</blockquote>
<font face="Arial, Helvetica, sans-serif" size="3">
<p><br>
  &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074;, &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1087;&#1086; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1102; &quot;&#1074;&#1099;&#1096;&#1077; - &#1085;&#1080;&#1078;&#1077;&quot;, 
  &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1095;&#1080;&#1089;&#1077;&#1083; &#1073;&#1077;&#1079; &#1079;&#1085;&#1072;&#1082;&#1072;; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1087;&#1086; 
  &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1102; &quot;&#1073;&#1086;&#1083;&#1100;&#1096;&#1077; - &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&quot;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1095;&#1080;&#1089;&#1077;&#1083; &#1089;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;.</p>
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1</b>
  </p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  cmp &#1057;&#1061;,0 ;CX=0?<br>
  je equal ;&#1045;&#1089;&#1083;&#1080; &#1076;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1087;&#1072; &#1084;&#1077;&#1090;&#1082;&#1091; equal</font>
<font face="Arial, Helvetica, sans-serif" size="3">
  <br>
  </p>
  </blockquote>
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2</b>
  </p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  cmp AX,1000 ;&#1055;&#1091;&#1089;&#1090;&#1100; AX=8000h=32768<br>
  ;(=-32768) <br>
  ja above ;32768 &gt; 1000. &#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1073;&#1091;&#1076;&#1077;&#1090;</font>
<font face="Arial, Helvetica, sans-serif" size="3">
  <br>
  </p>
  </blockquote>
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3</b>
  </p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  cmp AX,1000h ;&#1055;&#1091;&#1089;&#1090;&#1100; AX=8000h=-32768<br>
  ; (=32768) <br>
  jg greater ;-32768 &lt; 1000h. &#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;</font>
<font face="Arial, Helvetica, sans-serif" size="3">
  <br>
  </p>
  </blockquote>
<p align="center"><b>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 4</b></p>
  <blockquote>
<p><br>

</font>
    <font face="Verdana, Arial, Helvetica, sans-serif" size="3">
  int 21h ;&#1042;&#1099;&#1079;&#1086;&#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <br>
  jc error ;&#1045;&#1089;&#1083;&#1080; CF=1 (&#1086;&#1096;&#1080;&#1073;&#1082;&#1072;), &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; <br>
  ; &#1085;&#1072; &#1084;&#1077;&#1090;&#1082;&#1091; error</font></p>
</blockquote>
<font face="Arial, Helvetica, sans-serif" size="3">
<p><img src="pr.gif" > &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074; 
  &#1080;&#1084;&#1077;&#1102;&#1090; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; 16- &#1080; 32-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; (&#1087;&#1088;&#1080; &#1090;&#1077;&#1093; &#1078;&#1077; &#1084;&#1085;&#1077;&#1084;&#1086;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1093;) 
  &#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1077; -32768...+32767 &#1073;&#1072;&#1081;&#1090; &#1076;&#1083;&#1103; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; 
  &#1089; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; 16 &#1080; &#1074; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1077; -231...+231-1 &#1073;&#1072;&#1081;&#1090; &#1076;&#1083;&#1103; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1084; 
  &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; 32.</p>

</font>
<p>
&nbsp;
</p>
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index11.htm">
<img SRC="Back.gif" BORDER="0" width="73" height="22">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0" width="73" height="22">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index13.htm">
<img SRC="For.gif" BORDER="0" width="73" height="22">
</a>
</font>
</td>
</tr>
</table>
</body>
</html>
