<html>
<head>
<title>FTP(1)			   FreeBSD Reference Manual</title>
		    <style type="text/css">
TH.arial { font-family: Arial, Serif;}
P.topic { font-family: sans-serif;}
A.plain { text-decoration: none;}
A.topic01 { color: #006890;
font-family: sans-serif;
text-decoration: none;}
A.topic02 { color: #099771;
font-family: sans-serif;
text-decoration: none;}
A.topic03 { color: #719709;
font-family: sans-serif;
text-decoration: none;}
A.topic04 { color: #98650A;
font-family: sans-serif;
text-decoration: none;}
A.topic05 { color: #98340A;
font-family: sans-serif;
text-decoration: none;}
A.topic06 { color: #099607;
font-family: sans-serif;
text-decoration: none;}
A.topic07 { color: #9E1215;
font-family: sans-serif;
text-decoration: none;}
A.topic08 { color: #970941;
font-family: sans-serif;
text-decoration: none;}
A.topic09 { color: #950995;
font-family: sans-serif;
text-decoration: none;}
A.topic010 { color: #390A98;
font-family: sans-serif;
text-decoration: none;}
H1 { font-family: sans-serif;}
H2 { font-family: sans-serif;}
H3 { font-family: sans-serif;}
H4 { font-family: sans-serif;}
H5 { font-family: sans-serif;}
H6 { font-family: sans-serif;}
</style>
</head>
<body bgcolor="#FFFFFF" link="#006890" vlink="#003860" alink="#800000" text="#000000">
<table cellspacing=0 cellpadding=0 border=0 background="_pic_/header0.jpg" width="100%">
<tr><td align="center">
<table cellspacing=0 cellpadding=4 border=0 width="100%" background="">
<tr><td align="left">
<img src="_pic_/logo.gif" width=157 height=53 border=0 alt="Server for Information Technologies">
</td><td align="right">
<font size="-2">Сервер поддерживается<br><a class="plain" href="http://www.citmgu.ru">Центром Информационных Технологий</a><br>(095) 932-9212, 932-9213, 939-0783<br>E-mail: <a class=noneline href="mailto:info@citmgu.ru?Subject='From page topic CIT FORUM local copy'">info@citforum.ru</a></font>
</td></tr>
</table>
<table cellspacing=0 cellpadding=4 border=0 width="100%" background="">
<tr><td align="left">
<font size="-1">Сервер содержит море(!) аналитической информации</font>
</td><td align="right">
<font size="-1">CIT Forum CD-ROM</font>
</td></tr>
</table>
</td></tr>
</table>

<h3 align=center>FTP(1)			   FreeBSD Reference Manual</h3>
<p align=justify><b>ИМЯ</b><br>
     ftp - протокол передачи файлов ARPANET
<p><b>СИНТАКСИС</b>
<pre>
     ftp [-v] [-d] [-i] [-n] [-U] [-p] [-g] [host]
</pre>
<p align=justify><b>ОПИСАНИЕ</b><br>
	Программа ftp позволяет передавать файлы на удаленный компьютер
	или получать их оттуда, и работает с файлами и каталогами удаленного компьютера.
<p align=justify>	   При работе с ftp Вы запускаете на своем компьютере клиентную
	программу, которая связывается с серверной программой, работающей на удаленном компьютере. С помощью ftp Вы даете выполняемые
	серверной программой команды, которые транслируются в инструкции.
<p align=justify><b>РАБОТА С ftp.</b><br>
   Чтобы  использовать  программу  ftp,  вам нужно открыть связь между
вашей  и  удаленной  машиной,  куда  или  откуда вы хотите переместить
файл.   Эта   программа   позволяет   вам   иметь   несколько   связей
одновременно,  хотя  вы  можете  давать  команды, которые воздействуют
только  на  одну  связь. Многомашинная связь позволяет вам связаться с
несколькими  машинами  за один сеанс работы ftp. Вам нет необходимости
вновь  регистрироваться  на  другой  машине,  когда  вы хотите сменить
машину  для  связи.  Связь,  которая  используется  в  данный  момент,
называется текущей связью.
<p align=justify><b>Виды записи файла для передачи в ftp.</b><br>
   Программа  ftp  позволяет  использовать  два  вида записи ASCII или
двоичный.   Используйте  ASCII  для  текстовых  файлов.  Двоичный  вид
используется  для  двоичных  данных, которые должны представлять собой
непрерывную  последовательность  бит.  Для связи между UNIX машинами в
большинстве  случаев  может  быть использован ASCII код(он задается по
умолчанию).   Двоичный   вид  может  быть  использован  для  некоторых
специальных  файлов,  например  программные  объектные модули, если вы
используете машины с операционной системой отличной от UNIX.
<p align=justify><b>Условия присвоения имени файлу в ftp.</b><br>
   Если  первый символ в имени файла, который задаете в ftp, это дефис
(-),  то  ftp использует стандартный ввод (для чтения) или стандартный
вывод  (для  записи).  Если  первый  символ  в имени файла, который вы
задаете  в  ftp,  это  вертикальный  штрих,  то  остальная часть имени
воспринимается  как команда оболочки. Программа ftp вызывает командный
язык   с   помощью   имени   файла  и  затем  пользователь  использует
стандартный   ввод   или  стандартный  вывод.  Если  команда  содержит
пробелы, они должны быть выделены внутри кавычек. Например:
<pre>
    "Ѓ ls -ls"
</pre>
Символ (Ѓ) может быть внутри и вне кавычек.
<p align=justify><b>Вызов ftp.</b><br>
   Чтобы  вызвать  ftp  из  оболочки  UNIX, введите команду ftp. Когда
команда  это  выполнено,на  вашем экране появится промпт этой команды.
Он выглядит следующим образом:
<pre>
     ftp>
</pre>
   Вы  можете указать имя машины, с которой хотите связаться, хотя это
необязательно.   Следующий  пример  показывает  как  записывается  имя
машины admin:
<pre>
    $ ftp admin
</pre>
   Машинное  имя  устанавливается  вашим системным администратором. До
использования  ftp  вы  можете проверить разрешено ли это имя для вас,
распечатав  файл  /etc/hosts.  Когда  вы  пишете  имя  машины во время
вызова  ftp,  программа  устанавливает машинную связь с этой машиной и
разрешает  вам передачу файлов. Это эквивалентно использованию команды
ftp  open  для  установления  связи  с машиной, которую вы назвали. Вы
можете также вызвать ftp без имени машины, например:
<pre>
    $ ftp
</pre>
   Если  вы не установили имя машины при вызове ftp, вы должны открыть
связь  с  этой  машиной в ftp. Это делается используя ftp open команду
до   того   как  вы  начали  передавать  файлы.  Для  более  детальной
информации  по  этому  вопросу  смотри  раздел  "Описание  ftp команд"
дальше в этой главе.
<p align=justify><b>Опции ftp.</b><br>
   Дополнительно  при  вызове  ftp,  вы  можете задать некоторые опции
этой  команды.  Эти опции помещаются после названия команды ftp, но до
имени  машины,  если  оно  указывается. Каждая опция состоит из дефиса
(-)  и  одной  буквы, например: -v. Каждая опция имеет соответствующую
команду  того  же  имени,  которая может быть использована внутри ftp.
Вам  следует  различать  использование  опций  и  соответствующих  ftp
команд.  Для  детальной  информации  по  ftp  командам  смотри  раздел
"Описание ftp команд".
<table>
<tr valign=top><th> -v   <td> Заставляет ftp работать в многословном режиме. В этом
           режиме сообщения ftp, посланные удаленной машиной в ftp
           появляются на экране вашего дисплея. Кроме того, если вы
           используете этот режим после завершения передачи каждого
           файла появляется статистическое сообщение об этом. Этот
           режим устанавливается по умолчанию, если ftp выполняется
           интеррактивно. Если ftp выполняется в командном режиме,
           многословный режим выключен, тогда его включает опция -v.
           Вы можете включить этот режим внутри ftp с помощью команды
           ftp verbose.
<tr valign=top><th> -d  <td>   Заставляет ftp работать в режиме отладки. В этом режиме
           сообщения ftp, посланные ftp в удаленную машину,
           отображаются на экране вашего дисплея. Если вы не
           используете эту опцию, информация не отображается. Вы
           можете также вызвать этот режим в ftp, используя команду
           ftp debug.
<tr valign=top><th> -i  <td> Эта опция означает неинтерактивный промпт.
<tr valign=top><th> -n <td>  Предотвращает использование ftp авторегистрации, во время
           связи с удаленной машиной. Когда установлен режим
           авторегистрации, ftp идентифицирует вас автоматически на
           удаленной машине и регистрирует вас на этой машине.(Смотри
           раздел"Использование файла .netrc файла для автоматической
           регистрации" далле в этом разделе.) Если вы используете -n
           опцию для отключения автоматической регистрации, вы должны
           будете использовать команду ftp user, чтобы вручную
           зарегистрироваться на удаленной машине.
<tr valign=top><th>  -g  <td>  Является причиной лишения имен файлов UNIX их расширений,
           таких как универсальное (*). Если вы не используете эту
           опцию, ftp расширяет имена файлов с помощью универсального
           расширения в списке файлов. Вместо этой опции можно
           использовать команду ftp glob.
</table>
Ниже даны примеры использования ftp опций:
<pre>
     $ ftp -v -d admin
</pre>
   Вышеприведенная  команда  вызывает  ftp в многословном и отладочном
режиме  и  побуждает  ftp  открыть  связь с удаленной машиной по имени
admin.  В  отладочном  режиме  команды, посылаемые к удаленной машине,
изображаются  на  вашем  экране.  Многословный режим изображает ответы
получателя  и  статистические сведения о полученных байтах информации.
<pre>
     $ ftp -v -d
</pre>
   Вышеприведенная  команда  вызывает  ftp в многословном и отладочном
режиме, но не открывает связи с удаленной машиной.
<pre>
     $ ftp -n -g admin
</pre>
   Вышеприведенная  команда  вызывает  ftp c отменой авторегистрации и
универсального  расширения,  и  заставляет  открыть  связь с удаленной
машиной admin.
<pre>
     $ ftp -n -d
</pre>
   Вышеприведенная  команда  вызывает  ftp с отменой авторегистрации и
универсального расширения, не открывая связи с какой-либо машиной.
<p align=justify><b>Использование файла .netrc для автоматической регистрации.</b><br>
   Вы  можете создать файл по имени .netrc в вашем домашнем директории
в    качестве    дополнительного    удобства.   Этот   файл   содержит
строки-элементы  регистрационных данных для каждой машины, которая вам
нужна   для   автоматической   связи.  Смотрите  netrc(2)  для  полной
информации  по  этому  файлу. Когда вы вызываете ftp, указывая машину,
т.е.  когда  вы одновременно с вызовом открываете связь с машиной, ftp
читает файл  .netrc.  Если есть строка-элемент для этой машины, то ftp
автоматически  соединяет  вашу  машину  с  этой удаленной машиной. Это
произойдет  без  вашего  имени  и  пароля, если вы ввели пароль в этот
файл.  Если  вы открыли связь в многословном режиме, то вы увидите как
происходят  транзакции.  Формат  файла  состоит  из  отдельных  полей,
представленных ключевыми полями:
<pre>
  machine  имя  login  имя  password  пароль
</pre>
   где  machine,login,password это ключевые слова, за которыми следуют
символьные данные, необходимые для регистрации:
<table>
<tr valign=top><th> machine    <td>   Имя узла.
<tr valign=top><th> login    <td>  Пользовательское имя для регистрации.
<tr valign=top><th> password   <td>   Пароль пользователя на данном узле.(Пароль
                     пишется в нормальной незашифрованной форме
                     текста). Если вы включили ваш пароль в файл
                     .netrc, то вы должны читать/писать файл,
                     получив разрешение, чтобы предотвратить
                     открытие вашего пароля.
                     В противном случае ftp не позволит вам
                     использовать файл. Файловые разрешения должны
                     быть установлены от 400 до 600 для .netrc файла,
                     который включает пароль. Для дополнительной
                     информации по файловым разрешениям смотри
                     документацию по chmod(C).(В записи своего пароля
                     в файл есть определенный риск. Вы должны
                     взвесить все условия безопасности.) Спросите
                     своего администратора обо всех особенностях до
                     использования этого файла.
</table>
Если вы не введете пароль в файл, ftp спросит вас о нем.
Пример записи:
<pre>
     machine  admin  login  guido  password  open
</pre>
где: admin - имя узла, guido - пользователь, который регистрируется в
машине admin, open - пароль пользователя guido.
<p align=justify><b>Ограничение для ftp команд.</b><br>
   В   дополнение   к   командам,   которые   используют   стандартный
протокольные   функции  ftp, TCP/IP  предоставляет  несколько  команд,
которые   используют   функции   опций   ftp.  Такие  команды  следует
использовать  только для связи с машинами, работающими в UNIX или UNIX
совместимых  системах.  Команды, чье использование будет описано позже
в   этой  главе,  имеют  определенные  ограничения.  Когда  происходит
коммуникация  с  удаленной  машиной,  которая  не использует UNIX, вам
следует  спросить  системного  администратора  поддерживается ли ftp в
этой  машине  до  ее  использования. Некоторые ftp поддерживают не все
опции  команд.  Программа ftp может предоставить список поддерживаемых
команд.  Для получения такой информации нужно использовать команду ftp
remotehelp после установления связи с удаленной машиной.
<p align=justify><b>Описание команд ftp.</b><br>
   Когда  на  экране  появляется промпт ftp, вы можете вводить одну из
команд,  описанных ниже в этом разделе. После выполнения команды снова
появится  промпт  ftp.  В  зависимости от того ккакой режми установлен
режим   многословный  или  отладочный  могут  появится  дополнительные
сообщения.  После  каждой  команды  нужно  нажимать Return. Выполнение
команды  не начнется пока вы не нажмете Return. Если вы сделали ошибку
при   наборе   команды,   вы  можете  использовать  системную  команду
построчного   редактирования   erase(BKSP)   или  команду  символьного
редактирования kill(Cancel).
<p align=justify>   Вам  нет необходимости вводить имя команды полностью, можно вводить
определенное  количество  символов,  достаточное  для идентификации. В
большинстве  случаев это один или два символа от названия команды ftp.
<table>
<tr valign=top><th> !   <td>   Эта команда задерживает ftp и вызывает командный язык
           (shell) на локальной машине. Любой(ые) символ(ы) после
           восклицательного знака воспринимаются и выполняются как
           shell команды. Затем можно вернуться в ftp, выйдя из
           shell. Все ftp опции и связанные удаленные машины
           возвращаются в тоже самое состояние, которое было до
           появления этой команды. Если команда shell напечатана в
           той же строке, где и !, то выполняется только эта
           команда. После выполнения команды программа ftp
           возвращается в командный режим.
<tr valign=top><th>append <td>   Команда append заставляет ftp добавлять содержимое
           локального файла в конец файла удаленной машины, скоторой
           вы соединены в данный момент. Когда вы вызываете эту
           команду, вы можете указать какой файл к какому добавить,
           например:
<pre>
  ftp> append имя локального файла имя файла удаленной машины
</pre>
           В другом случае вы можете использовать только имя команды
           ftp, а затем получить запрос об имени файлов, например:
<pre>
  ftp> append
  (local-file) имя локального файла
  (remote-file) имя файла удаленной машины
</pre>
           Эту команду можно использовать только с теми машинами, что
           используют UNIX систему или с UNIX совместимыми машинами.
<tr valign=top><th>ascii  <td>   Эта команда побуждает ftp преобразовывать файлы в ASCII
           код. (По умолчанию код всегда ASCII).
<tr valign=top><th>bell   <td>   Эта команда приводит к тому, что на вашем терминале
           появляется сигнал после завершения передачи каждого файла.
           Чтобы прекратить подачу сигнала, нужно снова набрать эту
           команду ftp.
<tr valign=top><th>binary <td>   Эта команда побуждает ftp передавать файл в двоичном коде.
<tr valign=top><th>bye    <td>   По этой команде осуществляется выход из ftp. Эта команда
           закрывает все открытые связи.
<tr valign=top><th>cd  <td>    По этой команде имя директория на удаленной машине
           заменяется на новое. Вы можете записать новое имя, когда
           вызываете команду, как показано в примере:
<pre>
   ftp > cd /usr/bin
</pre>
           В противном случае вы можете использовать только имя
           команды ftp, тогда машина запросит имя нового директория,
           например:
<pre>
   ftp> cd
   (remote-directory) /usr/bin
</pre>
<tr valign=top><th> close   <td>  По этой команде закрывается текущая связь.
<tr valign=top><th>debug  <td>   Эта команда включает и выключает многословный режим. Если
           режим включается, то об этом появляется сообщение на вашем
           дисплее, при выключении сообщений нет.
<tr valign=top><th>delete  <td>  По этой команде удаляется файл в удаленной машине, к
           которой вы подключены в данный момент. Вы можете указать
           имя файла, который нужно удалить, при вызове ftp команды:
<pre> 
   ftp> delete имя файла для удаления
</pre>
           Если вам больше нравится, то вы можете не указывать имя
           при вызове команды ftp. Тогда машина вас запросит об
           имени, например:
<pre>
   ftp> delete
   (remote-file) имя файла для удаления
</pre>
<tr valign=top><th> dir  <td>   Эта команда выдаст вам детальный список директория на
           удаленной машине, к которой вы подключены.(Сравните с
           опцией ls, данной ниже).
           Вы можете задать имя директория, который нужно
           распечатать, при вызове команды ftp. Например:
<pre>
   ftp> dir /usr/bin
</pre>
           Если вы не указали имя директория, то будет распечатан
           текущий директорий на удаленной машине.
           Вы можете также побудить ftp занести результаты выполнения
           команды в файл до того как он появится на экране. Делается
           это следующим образом:
<pre>
   ftp> dir /usr/bin printfile
</pre>
           Вы должны указать имя директория до имени выходного файла
           (здесь printfile). Таким образом, если вы хотите
           напечатать текущий директорий в файле, называемом
           printfile, выполните следующее:
<pre>
   ftp> dir . printfile
</pre>
           где "." означает текущий директорий.
<tr valign=top><th>form   <td>   Эта команда выводит на экран формат файла, который
           используется. Обычно поддерживается непечатный формат.
<tr valign=top><th>get    <td>   Эта команда копирует файл из удаленной машины, к которой
           вы в данный момент подсоединены. Этот файл копируется в
           вашу машину (Используйте команду mget для копирования
           нескольких файлов одновременно). Когда вы вызываете эту
           команду, вы можете указать имя файла на удаленной машине и
           имя в вашей машине, в который вы скопируете файл.
           Например:
<pre>
   ftp> get имя файла удаленной машины имя файла вашей машины
</pre>
           Если вы просто укажете имя файла удаленной машины, который
           нужно скопировать, то файл на вашей машине будет иметь
           тоже самое имя. Пример:
<pre>
   ftp> get имя удаленной машины
</pre>
           Вы можете записать только команду ftp get. Тогда программа
           ftp запросит вас об имени файла,например:
<pre>
   ftp> get
   (remote-file) имя файла удаленной машины
   (local-file) имя файла вашей машины
</pre>
<tr valign=top><th> glob  <td>    Эта команда заставляет ftp запрещать расширение имен
           файлов UNIX, такое универсальное, как '* '. Эта команда
           служит и для запрещения и для разрешения расширения таким
           образом что, если задать ее повторно, то расширение вновь
           разрешено. После разрешения расширения расширения ftp ко
           всем именам файлов добавит расширение при выводе списка
           файлов.
<tr valign=top><th>hash   <td>   Эта команда побуждает ftp выдавать на экране символ '# '
           после каждого блока данных, который посылается удаленной
           машиной. Размер блоков данных может быть различным в
           зависимости от версии программного обеспечения. Для того,
           чтобы увидеть текущее значение, с командой ftp используйте
           многословный режим. Эта команда включает и выключает
           выдачу символа '#' на экран ее при повторном наборе.
<tr valign=top><th>help  <td>   Эта команда выдает на экран информацию о работе ftp. Если
           после help задать имя команды, то появится информация об
           этой команде. Если набрать просто help, то появится
           информация обо всех командах ftp.
<tr valign=top><th>lcd   <td>  Эта команда изменяет рабочий директорий, используемый ftp,
           на вашей машине. Вы можете задать имя директория, который
           вам нужен как рабочий, например:
<pre>
   ftp> lcd /ysr/deb
</pre>
           Если вы не задали имя директория, то будет использоваться
           ваш домашний директорий.
<tr valign=top><th>ls   <td>    Эта команда распечатывает абревиатурный список содержания
           директория удаленной машины, с которой вы связаны. Вы
           связаны в данный момент.
           Вы можете задать имя директория, который вы хотите
           распечатать. Например:
<pre>
   ftp> ls /usr/bin
</pre>
           Если вы не задали имя, будет распечатан текущий
           директорий.
           Можно задать, чтобы результаты выполнения команды были
           помещены в файл до появления их на дисплее. Это делается
           ftp, если указать имя файла на вашей машине куда следует
           поместить листинг директория, например:
<pre>
   ftp> ls /usr/bin printfile
</pre>
           Имя директория нужно задать до вывода файла (здесь
           printfile). Например, если вы хотите распечатать текущий
           директорий в файл с именем printfile:
<pre>
   ftp> ls . printfile
</pre>
           где "." ставится, чтобы подчеркнуть, что директорий
           текущий.
<tr valign=top><th> mdelete  <td> Эта команда удаляет список файлов на удаленной машине, с
           которой вы связаны в данный момент. Вы можете задать имена
           файлов для удаления при вызове команды. Например:
<pre>
   ftp> mdelete имя 1файла удаленной машины имя 2файла...
</pre>
           В противном случае вы можете просто использовать имя
           команды. Программа ftp запросит вас об имени(ах):
<pre>
   ftp> mdelete
   (remote-files) имя 1файла 2файла...
</pre>
<tr valign=top><th> mdir  <td>  По этой команде выдается список листинг директория
           удаленной машины и результат помещается в файл вашей
           машины. Вы можете задать список файлов удаленной машины и
           имя файла вашей машины, куда поместить результат при
           вызове команды. Например:
<pre>
   ftp> mdir имя 1файла удаленной машины... printfile
</pre>
           (Заметьте, что последее имя это имя файла вашей машины
           printfile).
           Возможно просто использовать имя команды. Тогда программа
           ftp запросит у вас имя файлов, например:
<pre>
   ftp> mdir
   (remote-files) имя 1файла удаленной машины...printfile
   local-file printfile?y
</pre>
<tr valign=top><th> mget  <td>   Эта команда копирования одного или более файлов с
           удаленной машины, к которой вы подключены в данный момент
           на вашу машину. Файлы после копирования будут иметь теже
           имена. Вы можете указать список файлов для копирования:
<pre>
   ftp> mget имя 1файла удаленной машины имя 2файла...
</pre>
           Если вы не задали имена файлов при вызове команды,
           программа ftp запросит вас о них:
<pre>
   ftp> mget
   (remote-files) имя 1файла удаленной машины имя 2файла ...
</pre>
<tr valign=top><th> mkdir  <td>   Эта команда создает директорий на удаленной машине, к
           которой вы в данный момент подключаетесь. Вы можете задать
           им директория при вызове команды, например:
<pre>
   ftp> mkdir /u/mydir
</pre>
           Если вы не задали имя, ftp запросит вас о нем, например:
<pre>
   ftp> mkdir
   (directory-name) имя директория
</pre>
           Эта команда поддерживается не всегда.
<tr valign=top><th> mls  <td>  Эта команда получает абревиатурный список группы файлов
           текущего директория на удаленной машине и помещает
           результат в файл на вашей машине.
           Вы можете задать список файлов удаленной машины и файл
           вашей машины, куда поместить результат при вызове команды,
           например:
<pre>
   ftp> mls имя 1файла удаленной машины ...printfile
</pre>
           Вы можете не указывать имена при вызове команды, и тогда
           прграмма запросит вас о них:
<pre>
   ftp> mls
   (remote-files) имя 1файла удаленной машины...printfile
   local-file printfile?y
</pre>
<tr valign=top><th> mput  <td>  Эта команда копирует один или более файлов с вашей машины
           в удаленную машину, с которой вы связаны в данный момент.
           На удаленной машине файлы будут иметь теже имена.
           Вы можете задать список фалов при вызове команды,например:
<pre>
   ftp> mput 1файл вашей машины 2файл вашей машины...
</pre>
           Если вы не указали имена, программа ftp вас об этом
           запросит:
<pre>
   ftp> mput
   (local-files) имя 1файла вашей машины имя 2файла...
</pre>
<tr valign=top><th> nmap  <td>   Используйте эту команду для установки и отмены механизма
           преобразования имен файлов. Эта команда полезна при связи
           с UNIX несовместимыми машинами и в которых используется
           другой способ именования файлов. Переименовывание файлов
           локальной машины производится с помощью get и mget команд,
           а удаленной машины с помощью put и mput команд. Команда
           mput комплексная.
<tr valign=top><th> ntrans <td> Используйте эту команду для включения и выключения
           механизма трансляции символов имени файла. Эта команда
           полезна при связи с UNIX несовместимой удаленной машиной,
           где применяется другой способ именования файлов.
           Трансляция имен файлов локальной машины производится с
           помощью get и mget команд, а удаленной машины с помощью
           put и mput команд. Команда mtrans комплексная. 
<tr valign=top><th> open  <td>   Эта команда устанавливает связь с удаленной машиной,
           которая предполагается для передачи файлов. При вызове
           команды вы можете указать имя машины, например:
<pre>
   ftp> open admin
</pre>
           Если имя не указано, программа запросит его:
<pre>
   ftp> open
   (to) имя машины
</pre>
           Если вы указали имя машины при вызове команды, вы можете
           также указать номер порта на удаленной машине. Если указан
           порт, то ftp откроет связь через этот порт, если он
           предпочтительнее того, что задается по умолчанию.
           Изменения порта делаются в том случае, если вас об этом
           поросят или это задается системным администратором. Если
           порт не задан, то программа его не запрашивает.
<tr valign=top><th> prompt  <td>  Эта команда предотвращает ваш запрос к ftp о разрешении на
           переход между файлами в многофайловых командах, таких как
           mget. Эта команда подключается и отключается при повторном
           наборе.
<tr valign=top><th> put  <td>   Эта команда перемещает файл из вашей машины в удаленную
           машину, к которой вы в данный момент подключены.(Для
           передачи нескольких файлов одновременно используйте
           команду mput). Вы можете задать имя файла вашей машины и
           имя файла удаленной машины при вызове команды ftp,пример:
<pre>
   ftp> put имя вашего файла имя файла удаленной машины
</pre>
           или
<pre>
   ftp> put имя вашего файла
</pre>
5-15 Инструкция по настройке
<br>Если вы не указали имя файлов(а), то программа вас о них
           запросит, например:
<pre>
   ftp> put
   (local-file) имя вашего файла
   (remote-file) имя файла удаленной машины
</pre>
           Если вы не укажете имя файла удаленной машины, то команда
           put создаст файл на удаленной машине под тем же именем,
           что и на вашей машине.
<tr valign=top><th> pwd   <td>  Эта команда вынуждает ftp печатать имя текущего рабочего
           директория на удаленной машине, с которой вы связаны в
           данный момент.
<tr valign=top><th> quit  <td>   Команда аналогична команде bye, о которой говорилось выше.
<tr valign=top><th> quote  <td>  Команда заставляет ftp посылать параметры, которые вы
           вводите в машину, посылать к удаленной машине для
           выполнения. Параметры это ftp команды и другие параметры.
           Те команды, что ftp поддерживает, могут быть отображены на
           экране с помощью команды remotehelp. Вы можете ввести эту
           команду при вызове программы ftp, например:
<pre>
   ftp> quote NLST
</pre>
           Если вы указали только имя команды, ftp спросит вас о
           командной строке, которую нужно использовать, например:
<pre>
   ftp> quote
   (command-line to send) NLST
</pre>
           Эту команду следует использовать только по совету вашего
           системного администратора.
<tr valign=top><th> recv   <td>  Эта команда аналогична команде get, описанной выше.
<tr valign=top><th>remotehelp<td> Эта команда запрашивает помощь ftp на удаленной машине, с
           которой вы связаны в данный момент. Эта информация
           сообщает о том какие команды поддерживает удаленная
           машина.
<tr valign=top><th> rename <td>  Эта команда переиновывает файл на удаленной машине, с
           которой вы связаны в текущий момент.
           При вызове команды вы можете использовать имена файлов,
           напрмер:
<pre>
   ftp> rename имя 1файла имя 2файла
</pre>
           Если вы использовали только имя команды при вызове
           программы, то машина запросит имена файлов:
<pre>
   ftp> rename
   (from-name) имя 1файла
   (to-name)  имя 2файла
</pre>
<tr valign=top><th> mdir  <td>  Эта команда удаляет директорий на удаленной машине, с
           которой вы связаны в данный момент. Вы можете задать имя
           директория, который следует удалить, при вызове команды,
           например:
<pre>
   ftp> rmdir /u/mydir
</pre>
           или вы можете не задавать имя при вызове команды, и машина
           запросит вас о нем:
<pre>
   ftp> rmdir
   (directory-name) /u/mydir
</pre>
           Эта команда не всегда поддерживается.
<tr valign=top><th> send <td>  Эта команда аналогична команде put, описанной выше.
<tr valign=top><th> sendport <td> Эта команда заставляет ftp запрещать возможность задания
           порта локальной машины для данных удаленной машины. Эта
           команда может подключаться и отключаться ее повторным
           набором. При вызове ftp по умолчанию задается определенный
           порт. Эту команду следует использовать по совету вашего
           системного администратора.
<tr valign=top><th> status  <td>  Это команда заставляет ftp изображать свой текущий статус
           на вашем терминале. Статус включает режимы, которые
           выбраны командами bell,form,hash,glob,port,type.
<tr valign=top><th> type  <td>   Эта команда устанавливает в каком виде передается файл.
           Допустимы коды ASCII и двоичный. Эта команда аналогична
           командам ascii и binary. Если вы не указали тип при вызове
           команды, то устанавливается ASCII.
<tr valign=top><th> trace  <td>  Эта команда заставляет ftp разрешать пакетную трассировку.
           Эта команда включается и отключается ее повторным набором.
           Эту команду следует использовать только по совету вашего
           системного администратора.
<tr valign=top><th> user  <td>  Эта команда позволяет вам идентифицировать самого себя на
           удаленной машине при установлении связи. Эта авторегистра-
           ция разрешена с опцией -n при вызове ftp. В этом случае
           данная команда не нужна.(Смотри раздел "Использование
           файла .netrc для автоматической регистрации" ранее в этой
           главе). Если автоматическая регистрация запрещена, то
           используйте эту команду для собственной регистрации и
           идентификации на удаленной машине.
           Удаленной машине нужно сообщить три вида информации кто
           вы: регистрационное имя, пароль и имя ресурса.
           Имя пользователя требуется для всех машин, пароль и имя
           ресурса требуются только для некоторых систем. Ваш
           системный администратор должен сказать что требуется для
           ваших машин. Он же должен подсказать вам правильное имя,
           пароль и имя ресурса, который вы хотите использовать.  Вы
           можете ввести всю эту информацию при вызове команды user,
           например:
<pre>
   ftp> user mike cat myaccount
</pre>
           Вы можете не указывать всю эту информацию при вызове
           команды. Тогда программа вас о ней запросит, например:
<pre>
   ftp> user
   (usename) mike(имя пользователя)
   password:
   Account: myaccount(имя ресурса)
</pre>
           Заметьте, что эхо не отражает ваш пароль при его наборе
           для защиты вашей информации. Если вы не набрали пароль или
           имя ресурса, то запроса о них не будет.
<tr valign=top><th> verbose <td>  Эта команда заставляет ftp запрещать многословный режим.
           Эта команда включается и выключается при повторном наборе.
           В многословном режиме ftp протокольные сообщения,
           посланные удаленной машиной появляются на вашем терминале.
           Кроме того, в этом режиме отображается статистика после
           передачи каждого файла. Если этот режим запрещен, то
           данная информация не изображается.
<tr valign=top><th> ?  <td>    Другое название команды help.
</table>
<p align=justify><b>Примеры работы ftp.</b><br>
   Этот  раздел иллюстрирует как можно использовать ftp. Ниже даны три
примера.  В этих  примерах используются три машины, локальная машина с
именем HERE и удаленная машина с именем THERE.
<p align=justify><b>Описание 1 примера.</b><br>
   Этот  пример  показывает  использование  ftp  для  посылки и приема
файлов.  Команда  ftp  вызывается с именем главной машины и происходит
автоматическая  регистрация  пользователя  на  другой  машине, т.к. не
используется опция -n.
<p align=justify>   Многословный   режим   запрещен   использованием  команды  verbose.
Пользователь  затем изменяет рабочий директорий на удаленной машине на
/etc   директорий.   Т.к.   нет  опции  -d  и  есть  команда  verbose,
многословный  режим  запрещен  и никаких сообщений, кроме промпта ftp,
не появляется.
<p align=justify>   Пользователь,  используя команду ls, получает абревиатурный листинг
директория  /etc машины THERE. команда ftp выдает три файла в каталоге
/etc.  Команда  get passwd затем копирует файл passwd с машины THERE в
машину  HERE.  Файл по имени passwd создается в машине HERE, если было
указано имя машины.
<p align=justify>   Команда  put  используется, чтобы скопировать файл по имени wall из
текущего  рабочего  директория  локальной  машины(HERE)  в  директорий
удаленной  машины  (THERE)  /etc. Этот файл копируется стем же именем,
т.к.  свое  имя  не было указано. После окончания передачи, появляется
листинг  /etc,  в  котором уже четыре файла, включая wall, который был
только что скопирован с машины HERE.
<p align=justify>   Затем   используется   команда  bye,  чтобы  вернуться  в  оболочку
операционной системы на локальной машине HERE.
<pre>
  $ ftp THERE          
  Connected to THERE  
  220 THERE FTP server (Version 4.160 #1) ready  
  Name (THERE:stevea):                          
  Password (THERE:stevea):                     
  331 Password required for stevea.           
  230 User stevea logged in.                 
  ftp> verbose                              
  Verbose mode off.                        
  ftp> cd /etc                            
  ftp> ls                                
  passwd                                
  volcopy                              
  whodo                               
  ftp> get paswd                     
  ftp>put wall                      
  ftp> ls                          
  passwd                          
  volcopy                        
  wall                          
  whodo                        
  ftp> bye                    
  $                          
</pre>
<b>Описание 2 примера.</b><br>
   Этот   пример  иллюстрирует  экранные  изображения,  которые  можно
получить,  используя  несколько  опций  ftp. После вызова ftp c именем
удаленной  главной  машины,  пользователь  вызывает  команду,  которая
позволит  вернуть  режим  отладки.  После  этого  команда  ftp  выдает
сообщения  на  экран,  что  свидетельствует о разрешении данной опции.
Пользователь  затем заменяет рабочий директорий на удаленной машине на
/etc.  Т.к.  присутствуют  отладочный и многословный режимы, на экране
будут  появляться  сообщения  о посылке команд к удаленной машине (-->
CWD/etc)  и  ответы,  полученные  с  удаленной машины (250 CWD command
successful  -  команда  прошла  успешно).  Заметьте,  что  cd команда,
которая  имеет такуюже форму, как команда изменения директория в UNIX,
посылается  в  виде  CDW  команды  (изменение  рабочего  директория на
удаленной  машине).  Эта  команда применяется ftp вместо cd, чтобы она
работала независимо от системной команды.
<p align=justify>   Следом  за  cd  командой  пользователь  ставит  pwd  команду, чтобы
подтвердить   изменение   рабочего   директория.   Команды  ftp  будут
изображать   на   вашем   экране  сообщения,  посылаемые  между  вашей
(локальной)  и  удаленной  машиной,  а  затем появится текущий рабочий
директорий  на  удаленной  машине.  Затем  пользователь  набирает hash
опцию,  на  что  появляется  сообщение,  что  данная  опция разрешена.
Команда  get  wall  myfile  приказывает  ftp  восстановить файл wall и
поместить  его  в  файл  myfile  в текущем рабочем директории на вашей
машине.  Команда  ftp  выдаст  сообщения, посылаемые между локальной и
удаленной  машинами  о начале передачи и затем печатает hash метку для
каждого  блока,  полученной  информации.  После завершения передачи на
экране  появляется  статистика,  в  которой время, потребовавшееся для
передачи,  и  дата  передачи файла. После получения файла пользователь
закрывает связь командой close и выходит из ftp командой bye.
<pre>
  $ ftp THERE                                 
  Connected to THERE                           
  220 THERE FTP server (Version 4.160 #1) ready 
  Name (THERE:stevea):                           
  Password (THERE:stevea):                        
  331 Password required for stevea.                
  ftp> debug                                        
  Debugging on (debug = 1)                           
  ftp> cd /etc                                        
  ---> CDW /etc                                        
  200 CDW command okay.                                 
  ftp> pwd                                               
  ---> PWD                                                
  251                                                      
  ftp> hash                                                 
  Hash mark printing on (1024 bytes/hash mark).              
  ftp> get wall mefile                                        
  ---> PORT 3,20,0,2,4,51                                      
  200 PORT command okay.                                        
  ---> RETR wall                                                 
  150 Opening data connection for wall (3.20.0.2.1075)(24384bytes
  #######################.                                        
  226 Transfer complete.                                          
  24550 bytes received in 12.00 seconds (2 Kbytes/s)              
  ftp> close                                                      
  ---> QUIT                                                       
  221 Goodbye.                                                    
  ftp> bye                                                        
  $ 
</pre>
<p><b>СМ. ТАКЖЕ</b><br>
     ftpd(8)
<p align=justify><b>ИСТОРИЯ</b><br>
     Команда ftp появилась в 4.2BSD.
<table cellspacing=0 cellpadding=0 border=0 background="_pic_/footer0.jpg" width="100%">
<tr><td align="center">
<table cellspacing=0 cellpadding=4 border=0 width="100%" background="">
<tr><td align="right" valign="top" width="33%">
<font size="-2">Comments: <a class="plain" href="mailto:info@citmgu.ru?Subject='From bottom of CIT FORUM local copy'">info@citmgu.ru</a><br>
Designed by <a class="plain" href="mailto:andrey@novikov.com">Andrey Novikov</a><br>
Copyright &copy; <a class="plain" href="http://www.citmgu.ru/">CIT</a></font>
</td></tr>
</table>
</td></tr>
</table>
</body>
</html>
