<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<title>
</title>
<meta http-equiv="Content-Type" content="text/html;charset=windows-1251">
</head>
<body background="../FON.JPG" BGCOLOR="#E7E3E7" TEXT="#000000" LINK="#004080" VLINK="#004080">
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index4.htm">
<img SRC="Back.gif" BORDER="0">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index6.htm">
<img SRC="For.gif" BORDER="0">
</a>
</font>
</td>
</tr>
</table>
<p>
&nbsp;
</p>
<p align="center">
<font face="Arial, Helvetica, sans-serif" size="3">
<font size="4">
&#1057;&#1090;&#1077;&#1082;
</font>
<br>
</font>
</p>
<p align="left">
<font face="Arial, Helvetica, sans-serif" size="3">

&#1057;&#1090;&#1077;&#1082;&#1086;&#1084; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; 
  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1076;&#1083;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1056;&#1072;&#1079;&#1091;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103;, &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; 
  &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1080; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; 
  &#1085;&#1072; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072;&#1076;&#1086; &#1079;&#1072;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1103;&#1095;&#1077;&#1081;&#1082;&#1091; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1095;&#1090;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; 
  &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1080;&#1084;&#1077;&#1085;. &#1059;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1086; &#1089;&#1090;&#1077;&#1082;&#1072; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; 
  &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1077;&#1075;&#1086; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; 
  &#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1072; &#1080;&#1093; &#1086;&#1090;&#1090;&#1091;&#1076;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; push &#1080; pop &#1073;&#1077;&#1079; 
  &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1084;&#1077;&#1085;.<br>
  &#1057;&#1090;&#1077;&#1082; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;, 
  &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;, &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, 
  &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &quot;&#1074; &#1089;&#1074;&#1086;&#1080;&#1093; &#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1094;&#1077;&#1083;&#1103;&#1093;&quot;. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; 
  &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1080;&#1079; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1044;&#1088;&#1091;&#1075;&#1086;&#1081; 
  &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1077;&#1084; - &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1093; &#1077;&#1102; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1095;&#1077;&#1088;&#1077;&#1079; 
  &#1089;&#1090;&#1077;&#1082;. &#1055;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;, &#1079;&#1085;&#1072;&#1103;, &#1074; &#1082;&#1072;&#1082;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1074; &#1089;&#1090;&#1077;&#1082; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1073;&#1088;&#1072;&#1090;&#1100; 
  &#1080;&#1093; &#1086;&#1090;&#1090;&#1091;&#1076;&#1072; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1089;&#1074;&#1086;&#1077;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080;.<br>
  &#1054;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1090;&#1077;&#1082;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1085;&#1099;&#1081; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093;&#1089;&#1103; 
  &#1074; &#1085;&#1077;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;: &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, 
  &#1090;.&#1077;. &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1089;&#1090;&#1077;&#1082; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;. &#1042;&#1099;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; 
  &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;.<br>
  &#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1090;&#1077;&#1082;&#1072; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1086;&#1090;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076; &#1089;&#1090;&#1077;&#1082;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; 
  &#1089;&#1086; &#1076;&#1085;&#1072; &#1089;&#1090;&#1077;&#1082;&#1072; (&#1090;.&#1077;. &#1089; &#1077;&#1075;&#1086; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;) &#1087;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1102;&#1097;&#1080;&#1084;&#1089;&#1103; 
  &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084;. &#1040;&#1076;&#1088;&#1077;&#1089; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077;-&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077; &#1089;&#1090;&#1077;&#1082;&#1072;
SP. &#1050;&#1072;&#1082; &#1080; &#1083;&#1102;&#1073;&#1072;&#1103; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1089;&#1090;&#1077;&#1082; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1074; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; 
  &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1080;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;. &#1042; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; 
  &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1089;&#1090;&#1077;&#1082;&#1072;
SS. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1087;&#1072;&#1088;&#1072; 
  &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; SS:SP &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1081; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1089;&#1090;&#1077;&#1082;&#1072;: &#1074; SS &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; 
  &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1090;&#1077;&#1082;&#1072;, &#1072; &#1074; SP - &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; (&#1088;&#1080;&#1089;. 
  1.10, &#1072;). &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072; 
  SP &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1103;&#1095;&#1077;&#1081;&#1082;&#1091;, &#1083;&#1077;&#1078;&#1072;&#1097;&#1091;&#1102; &#1087;&#1086;&#1076; &#1076;&#1085;&#1086;&#1084; &#1089;&#1090;&#1077;&#1082;&#1072; &#1080; &#1085;&#1077; &#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1091;&#1102; &#1074; &#1085;&#1077;&#1075;&#1086;.</font></p>
<p align="center"><img src="gl1-10.jpg" ></p>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="3"><b>&#1056;&#1080;&#1089;. 1.10.
</b> &#1054;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; 
  &#1089;&#1090;&#1077;&#1082;&#1072;:<br>
<b>
  &#1072;</b> - &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;, &#1073; - &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; (&#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; 
  - &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1040;&#1061;), <b> &#1074;</b> - &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; (&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; 
  &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; DS), <b> &#1075;</b> - &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;,<b> &#1076;</b> - &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1076;&#1074;&#1091;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; 
  &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;.</font></p>
<p><font face="Arial, Helvetica, sans-serif" size="3">&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1074; &#1089;&#1090;&#1077;&#1082; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; 
  &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1086;&#1084; push (&#1087;&#1088;&#1086;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;). &#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; 
  &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090; &#1085;&#1072; 2 &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089;&#1090;&#1077;&#1082;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; 
  &#1074; SP. &#1045;&#1089;&#1083;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; 
  &#1040;&#1061;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;</font></p>
<blockquote>
<p><font size="3" face="Verdana">push &#1040;&#1061;
  </font><font size="3" face="Times New Roman, Times, serif"><br>
  </font></p>
</blockquote>
<p><font face="Arial, Helvetica, sans-serif" size="3">&#1057;&#1090;&#1077;&#1082; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;, 
  &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072; &#1088;&#1080;&#1089;. 1.10, &#1073;. &#1042;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072; &#1089;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1076;&#1074;&#1072; &#1073;&#1072;&#1081;&#1090;&#1072; 
  &#1074;&#1074;&#1077;&#1088;&#1093; (&#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1093; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;) &#1080; &#1087;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; 
  &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; &#1087;&#1088;&#1086;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;. &#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1074; &#1089;&#1090;&#1077;&#1082;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,<br>
</font></p>
<blockquote>
<p><font size="3" face="Verdana">push DS
  </font><font size="3" face="Times New Roman, Times, serif"><br>
  </font></p>
</blockquote>
<p><font face="Arial, Helvetica, sans-serif" size="3">&#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1090;&#1077;&#1082; &#1074; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;, 
  &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072; &#1088;&#1080;&#1089;. 1.10, &#1074;. &#1042; &#1089;&#1090;&#1077;&#1082;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1076;&#1074;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; 
  &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072;
SP. &#1045;&#1089;&#1083;&#1080; 
  &#1089;&#1087;&#1091;&#1089;&#1090;&#1103; &#1082;&#1072;&#1082;&#1086;&#1077;-&#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072;&#1084; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; 
  &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;, &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1099;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; pop (&#1074;&#1099;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;):</font><font size="3" face="Times New Roman, Times, serif"><br>
  </font></p>
<blockquote>
<p><font size="3" face="Verdana">pop DS
  </font></p>
<p><font size="3" face="Verdana"> <br>
  pop AX
  </font><font size="3" face="Times New Roman, Times, serif"><br>
  </font></p>
</blockquote>
<p><font face="Arial, Helvetica, sans-serif" size="3">&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1089;&#1090;&#1077;&#1082;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; 
  &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1088;&#1080;&#1089;. 1.10, &#1075;, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; - &#1085;&#1072; &#1088;&#1080;&#1089;. 1.10, &#1076;. &#1044;&#1083;&#1103; 
  &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1074;&#1099;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; 
  &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1084; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; - &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1074;&#1099;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; 
  &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1080; &#1090;.&#1076;.<br>
  &#1057;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1080;&#1093; &#1090;&#1091;&#1076;&#1072;, &#1075;&#1076;&#1077; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; 
  &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; &#1089;&#1090;&#1077;&#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;
DS, &#1072; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; 
  &#1077;&#1075;&#1086; &#1086;&#1090;&#1090;&#1091;&#1076;&#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; - ES;</font><font size="3" face="Times New Roman, Times, serif"><br>
  </font></p>
<blockquote>
<p><font size="3" face="Verdana">push DS
  </font></p>
<p><font size="3" face="Verdana"><br>
  pop ES ; &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; ES=DS, &#1072; &#1089;&#1090;&#1077;&#1082; &#1087;&#1091;&#1089;&#1090;
  </font><font size="3" face="Times New Roman, Times, serif"><br>
  </font></p>
</blockquote>
<p><font face="Arial, Helvetica, sans-serif" size="3">&#1069;&#1090;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1077;&#1084; 
  &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; 
  &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; - &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081;.<br>
  &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; (&#1089;&#1084;. &#1088;&#1080;&#1089; 1.10) &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; 
  &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1085;&#1080; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077; &#1089;&#1090;&#1077;&#1088;&#1083;&#1080;&#1089;&#1100;, &#1072; &#1086;&#1089;&#1090;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1089;&#1090;&#1077;&#1082;&#1072; &#1085;&#1072; &#1089;&#1074;&#1086;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;. 
  &#1055;&#1088;&#1072;&#1074;&#1076;&#1072;, &#1087;&#1088;&#1080; &quot;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081;&quot; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1086;&#1084; &#1086;&#1085;&#1080; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080;. 
  &#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072; SP &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1076; &#1076;&#1085;&#1086; &#1089;&#1090;&#1077;&#1082;&#1072;, &#1089;&#1090;&#1077;&#1082; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; 
  &#1087;&#1091;&#1089;&#1090;&#1099;&#1084;; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; push &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090; &#1085;&#1086;&#1074;&#1086;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1085;&#1077;&#1077; 
  &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1040;&#1061;, &#1079;&#1072;&#1090;&#1077;&#1088;&#1077;&#1074; &#1077;&#1075;&#1086;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1086;&#1082;&#1072; &#1089;&#1090;&#1077;&#1082; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077; &#1079;&#1072;&#1090;&#1077;&#1088;&#1090;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; 
  &#1080; &#1091;&#1078;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1080;&#1079; &#1085;&#1077;&#1075;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1074; &#1082;&#1072;&#1082;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; 
  &#1086;&#1085;&#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1077;&#1084; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080;.<br>
  &#1050;&#1072;&#1082;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1089;&#1090;&#1077;&#1082;? &#1069;&#1090;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1090;&#1077;&#1085;&#1089;&#1080;&#1074;&#1085;&#1086; &#1086;&#1085; 
  &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1045;&#1089;&#1083;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; 
  &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1084; 10 000 &#1073;&#1072;&#1081;&#1090;, &#1090;&#1086; &#1089;&#1090;&#1077;&#1082; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1072;&#1076;&#1086; 
  &#1080;&#1084;&#1077;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1074; &#1088;&#1103;&#1076;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1089;&#1090;&#1077;&#1082; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;, &#1074; 
  &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; int 21h. &#1055;&#1086; &#1101;&#1090;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1074; &#1089;&#1090;&#1077;&#1082; &#1072;&#1076;&#1088;&#1077;&#1089; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; DOS &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1090;&#1091;&#1076;&#1072; &#1078;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; 
  &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1080; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1091;&#1102;&#1089;&#1103; &#1082; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, 
  &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1089;&#1090;&#1077;&#1082;, &#1086;&#1085; &#1074;&#1089;&#1077; &#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; 
  &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1080; &#1080;&#1084;&#1077;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1076;&#1077;&#1089;&#1103;&#1090;&#1082;&#1086;&#1074; &#1089;&#1083;&#1086;&#1074;. &#1042; &#1085;&#1072;&#1096;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; 
  &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1084;&#1099; &#1086;&#1090;&#1074;&#1077;&#1083;&#1080; &#1087;&#1086;&#1076; &#1089;&#1090;&#1077;&#1082; 128 &#1089;&#1083;&#1086;&#1074;, &#1095;&#1090;&#1086; &#1073;&#1077;&#1079;&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;.</font></p>

<p>
&nbsp;
</p>
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index4.htm">
<img SRC="Back.gif" BORDER="0">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index6.htm">
<img SRC="For.gif" BORDER="0">
</a>
</font>
</td>
</tr>
</table>
</body>
</html>