<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<title>
</title>
<meta http-equiv="Content-Type" content="text/html;charset=windows-1251">
</head>
<body background="../FON.JPG" BGCOLOR="#E7E3E7" TEXT="#000000" LINK="#004080" VLINK="#004080">
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index1.htm">
<img SRC="Back.gif" BORDER="0">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index3.htm">
<img SRC="For.gif" BORDER="0">
</a>
</font>
</td>
</tr>
</table>
<p>
&nbsp;
</p>
<p align="center">
<font face="Arial, Helvetica, sans-serif" size="3">
<font size="4">
&#1056;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;
</font>
<br>
</font>
</p>
<p align="left">
<font face="Arial, Helvetica, sans-serif" size="3">

&#1053;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1076;&#1091;&#1084;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; 
  &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1099; &quot;&#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;&quot; &#1080; &quot;&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1072;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&quot; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1099;. 
  &#1040;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; - &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1084;&#1077;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1089;&#1077; &#1101;&#1090;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1102;&#1090; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; 
  &#1103;&#1095;&#1077;&#1081;&#1082;&#1072;&#1084; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1042; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1080; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1072; 
  &#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1080;&#1092;&#1077;&#1088;&#1080;&#1081;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; 
  &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; 
  &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1091;&#1085;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;. &#1058;&#1080;&#1087;&#1080;&#1095;&#1085;&#1072;&#1103; &#1089;&#1093;&#1077;&#1084;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; 
  &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1072; &#1085;&#1072; &#1088;&#1080;&#1089;. 1.5. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; &#1085;&#1072; &#1101;&#1090;&#1086;&#1084; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077;, &#1082;&#1072;&#1082; &#1080; &#1087;&#1086;&#1074;&#1089;&#1102;&#1076;&#1091;
&#1076;&#1072;&#1083;&#1100;&#1096;&#1077; 
  &#1074; &#1082;&#1085;&#1080;&#1075;&#1077;, &#1076;&#1072;&#1085;&#1099; &#1074; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;. </font></p>
<p align="center"><img src="gl1-5.jpg" ></p>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="3"><b>&#1056;&#1080;&#1089;. 1.5.
</b> &#1058;&#1080;&#1087;&#1080;&#1095;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; 
  &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;.</p>

<p>
  <br>
  &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; 640 &#1050;&#1073;&#1072;&#1081;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1089; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084;&#1080; &#1086;&#1090; 00000h &#1076;&#1086; 9FFFF11 (&#1080;, 
  &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1084;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084;&#1080; &#1086;&#1090; 0000h &#1076;&#1086; 9FFFh) &#1086;&#1090;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1091;&#1102; 
  &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1091;&#1102; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1077;&#1097;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081;
(conventional). &#1053;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; 
  &#1082;&#1080;&#1083;&#1086;&#1073;&#1072;&#1081;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1079;&#1072;&#1085;&#1103;&#1090; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; 
  &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;, &#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; 256 &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1087;&#1086; 4 &#1073;&#1072;&#1081;&#1090;&#1072; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081;. 
  &#1042;&#1089;&#1083;&#1077;&#1076; &#1079;&#1072; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
BIOS, 
  &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077;&#1075;&#1086; 256 &#1073;&#1072;&#1081;&#1090;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; 40h. &#1057;&#1072;&#1084;&#1072; BIOS 
  (&#1086;&#1090; Basic In-Out System, &#1073;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072;-&#1074;&#1099;&#1074;&#1086;&#1076;&#1072;) &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; 
  &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1077;&#1081;&#1089;&#1103; &#1074; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1084; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077;. &#1069;&#1090;&#1086; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; 
  (&#1055;&#1047;&#1059; BIOS) &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1081; &#1087;&#1083;&#1072;&#1090;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, 
  &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086;, &#1080;&#1083;&#1080; &quot;&#1079;&#1072;&#1096;&#1080;&#1090;&#1086;&#1075;&#1086;&quot; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1042; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; 
  BIOS &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1087;&#1088;&#1080; &#1077;&#1075;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080;, &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1091;&#1102; 
  &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;
MS-DOS, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1077;&#1081;&#1089;&#1103; &#1085;&#1072; &#1084;&#1072;&#1075;&#1085;&#1080;&#1090;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1072;&#1093;, 
  &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1096;&#1090;&#1072;&#1090;&#1085;&#1086;&#1081; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1091;&#1088;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; - &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1086;&#1081;, &#1101;&#1082;&#1088;&#1072;&#1085;&#1086;&#1084;, &#1076;&#1080;&#1089;&#1082;&#1072;&#1084;&#1080; 
  &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1084;. &#1042; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; BIOS &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1085;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; 
  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080; BIOS &#1074; &#1089;&#1074;&#1086;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;. &#1058;&#1072;&#1082;, &#1079;&#1076;&#1077;&#1089;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103;:</p>
<ul>
  <li>&#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1073;&#1091;&#1092;&#1077;&#1088; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;, &#1082;&#1091;&#1076;&#1072; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1102;&#1090; &#1082;&#1086;&#1076;&#1099; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;;</li>
  <li>&nbsp;&#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;&#1072;&#1076;&#1072;&#1087;&#1090;&#1077;&#1088;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1086;&#1088;&#1090;&#1086;&#1074;;</li>
  <li>&#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; (&#1092;&#1086;&#1088;&#1084;&#1072; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1080; &#1077;&#1075;&#1086; 
  &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;, &#1074;&#1080;&#1076;&#1077;&#1086;&#1088;&#1077;&#1078;&#1080;&#1084;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1072;&#1103; &#1074;&#1080;&#1076;&#1077;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1080; &#1087;&#1088;&#1086;&#1095;.);</li>
  <li>&#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1076;&#1083;&#1103; &#1086;&#1090;&#1089;&#1095;&#1077;&#1090;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1080; &#1090;.&#1076;.</li>
</ul>
<p>
  &#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; BIOS &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;, 
  &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;. &#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1077; 
  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082; &#1101;&#1090;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; 
  &#1089; &#1094;&#1077;&#1083;&#1100;&#1102; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1085;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1057; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1103;&#1095;&#1077;&#1081;&#1082;&#1072;&#1084;&#1080; 
  &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; BIOS &#1084;&#1099; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1077;&#1084;&#1089;&#1103; &#1087;&#1088;&#1080; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;.<br>
  &#1042; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; 500h, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; 
  &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; MS-DOS, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1077;&#1089;&#1103;&#1090;&#1082;&#1086;&#1074; &#1050;&#1073;&#1072;&#1081;&#1090;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;
MS-DOS, &#1082;&#1072;&#1082; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077;
&#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; (&#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1099; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;, &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
BIOS) &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;.<br>
  &#1042;&#1089;&#1103; &#1086;&#1089;&#1090;&#1072;&#1074;&#1096;&#1072;&#1103;&#1089;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1076;&#1086; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; 640 &#1050;&#1073;&#1072;&#1081;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1072; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1083;&#1102;&#1073;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; 
  &#1080;&#1083;&#1080; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;. &#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1089;&#1077;&#1072;&#1085;&#1089;&#1072; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1102;&#1090; &#1088;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; 
  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; (&#1088;&#1091;&#1089;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;, &#1072;&#1085;&#1090;&#1080;&#1074;&#1080;&#1088;&#1091;&#1089;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;). &#1055;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1088;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; 
  &#1086;&#1073;&#1098;&#1077;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103;.<br>
  &#1054;&#1089;&#1090;&#1072;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; 384 &#1050;&#1073;&#1072;&#1081;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;&#1080; 640 &#1050;&#1073;&#1072;&#1081;&#1090; &#1080; 1 &#1052;&#1073;&#1072;&#1081;&#1090;, 
  &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081;, &#1080;&#1083;&#1080; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; (upper) &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102;, &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1083;&#1080; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; 
  &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1093; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; (&#1055;&#1047;&#1059;). &#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1086;&#1076; &#1055;&#1047;&#1059; 
  &#1079;&#1072;&#1085;&#1103;&#1090;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;, &#1072; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1094;&#1077;&#1083;&#1103;&#1093;.<br>
  &#1063;&#1072;&#1089;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1086;&#1090;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; &#1082; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1091; 
  &#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084;&#1091; &#1074;&#1080;&#1076;&#1077;&#1086;&#1073;&#1091;&#1092;&#1077;&#1088;&#1072;&#1084; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1072;&#1076;&#1072;&#1087;&#1090;&#1077;&#1088;&#1072;. &#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1072;&#1076;&#1072;&#1087;&#1090;&#1077;&#1088; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; 
  &#1089;&#1086;&#1073;&#1086;&#1081; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1093;&#1077;&#1084;&#1091; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1083;&#1072;&#1090;&#1091;, &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; 
  &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; (&#1074;&#1080;&#1076;&#1077;&#1086;&#1087;&#1072;&#1084;&#1103;&#1090;&#1100;). &#1069;&#1090;&#1086; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; 
  &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1082; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1077;&#1075;&#1086; &#1089;&#1093;&#1077;&#1084;&#1099; 
  &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1099; &#1085;&#1072; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1099; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; A0000h...AFFFFh &#1080; B8000h...BFFFFh, 
  &#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1093; &#1074; &#1086;&#1073;&#1097;&#1077;&#1077; &#1089; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1102;&#1073;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; 
  &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1101;&#1090;&#1080;&#1084; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084; &#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077;&#1086;&#1073;&#1091;&#1092;&#1077;&#1088;, 
  &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1041;&#1077;&#1083;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; 
  &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;, &#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; 
  &#1074;&#1080;&#1076;&#1077;&#1086;&#1073;&#1091;&#1092;&#1077;&#1088;&#1072;, &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1093; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; (&#1073;&#1091;&#1082;&#1074;, &#1094;&#1080;&#1092;&#1088;, 
  &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1082;&#1086;&#1074;). &#1045;&#1089;&#1083;&#1080; &#1078;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084;, &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; 
  &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1080;&#1076;&#1077;&#1086;&#1073;&#1091;&#1092;&#1077;&#1088;, &#1090;&#1086; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1087;&#1086;&#1103;&#1074;&#1103;&#1090;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1080;&#1083;&#1080; &#1083;&#1080;&#1085;&#1080;&#1080;. 
  &#1052;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1103;&#1095;&#1077;&#1077;&#1082; &#1074;&#1080;&#1076;&#1077;&#1086;&#1073;&#1091;&#1092;&#1077;&#1088;&#1072;.<br>
  &#1042; &#1089;&#1072;&#1084;&#1086;&#1084; &#1082;&#1086;&#1085;&#1094;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;, &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; F0000h...FFFFFh, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; 
  &#1055;&#1047;&#1059; BIOS - &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1077; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1091;&#1078;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1096;&#1077;.<br>
  &#1063;&#1072;&#1089;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; C0000h, &#1086;&#1090;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1077;&#1097;&#1077; &#1087;&#1086;&#1076; &#1086;&#1076;&#1085;&#1086; 
  &#1055;&#1047;&#1059; - &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; &#1055;&#1047;&#1059; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081; BIOS &#1076;&#1083;&#1103; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1072;&#1076;&#1072;&#1087;&#1090;&#1077;&#1088;&#1086;&#1074; 
  &#1080; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;.<br>
  &#1042; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;, &#1085;&#1072;&#1088;&#1103;&#1076;&#1091; &#1089;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102; (640 &#1050;&#1073;&#1072;&#1081;&#1090;), &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1077;&#1097;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1072;&#1103;
(extended) &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;, &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1084; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1086;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1076;&#1086; 4 &#1043;&#1073;&#1072;&#1081;&#1090;. &#1069;&#1090;&#1072; 
  &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1084;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1084;&#1077;&#1075;&#1072;&#1073;&#1072;&#1081;&#1090;&#1072; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080; 
  &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; 100000h. &#1056;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072; &#1084;&#1072;&#1096;&#1080;&#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1085;&#1077; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; 
  &#1086;&#1073;&#1098;&#1077;&#1084; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1072; &#1083;&#1080;&#1096;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1077;&#1089;&#1103;&#1090;&#1082;&#1086;&#1074; &#1052;&#1073;&#1072;&#1081;&#1090; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;.<br>
  &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1087;&#1086;&#1076;&#1095;&#1080;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &quot;&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; 
  &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;&quot; (Extended Memory Specification, &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;
XMS), &#1090;&#1086; 
  &#1080; &#1089;&#1072;&#1084;&#1091; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1095;&#1072;&#1089;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; XMS-&#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102;. &#1050;&#1072;&#1082; &#1091;&#1078;&#1077; &#1086;&#1090;&#1084;&#1077;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1096;&#1077;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; 
  &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1076;&#1083;&#1103;
MS-DOS, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1077;&#1081; 
  &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;, &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1072;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; 
  &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; MS-DOS &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; HIMEM.SYS, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;, 
  &#1090;.&#1077;. &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1093;&#1086;&#1090;&#1103; &#1080; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. &#1050;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086; &#1074; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; 
  &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1099;&#1077; &#1076;&#1080;&#1089;&#1082;&#1080; (&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;
RAMDRIVE.SYS) 
  &#1080;&#1083;&#1080; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1077; &#1082;&#1101;&#1096;-&#1073;&#1091;&#1092;&#1077;&#1088;&#1099; (&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072;
SMARTDRV.SYS).<br>
  &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; 64 &#1050;&#1073;&#1072;&#1081;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1090;&#1086;&#1095;&#1085;&#1077;&#1077;, 64 &#1050;&#1073;&#1072;&#1081;&#1090; - 16 &#1073;&#1072;&#1081;&#1090; &#1089; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084;&#1080; &#1086;&#1090; 
  l00000h &#1076;&#1086; l0FFEFh, &#1085;&#1086;&#1089;&#1103;&#1090; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;
(High MemoryArea, HMA). &#1069;&#1090;&#1072; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1093;&#1086;&#1090;&#1103; &#1086;&#1085;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1084;&#1080; 
  &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1084;&#1077;&#1075;&#1072;&#1073;&#1072;&#1081;&#1090;&#1072;, &#1082; &#1085;&#1077;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;, 
  &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074; &#1089;&#1072;&#1084;&#1086;&#1084; &#1082;&#1086;&#1085;&#1094;&#1077; &#1084;&#1077;&#1075;&#1072;&#1073;&#1072;&#1081;&#1090;&#1085;&#1086;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;, 
  &#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; FFFFh, &#1080; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080; &#1040;20. &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; 
  16 &#1073;&#1072;&#1081;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1079;&#1072;&#1085;&#1103;&#1090;&#1099; &#1055;&#1047;&#1059;, &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1078;&#1077; &#1089;&#1086; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; 0010h...FFFFh &#1084;&#1086;&#1078;&#1085;&#1086; 
  &#1074; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;. MS-DOS &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1074; 
  &#1053;&#1052;&#1051; (&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;&#1072; CONFIG.SYS DOS=HIGH) &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1089;&#1072;&#1084;&#1086;&#1081; &#1089;&#1077;&#1073;&#1103;, &#1074; 
  &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1095;&#1077;&#1075;&#1086; &#1079;&#1072;&#1085;&#1103;&#1090;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103;. 
  &#1057;&#1090;&#1072;&#1088;&#1096;&#1091;&#1102; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1086;&#1090; &#1078;&#1077; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;
HIMEM.SYS, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; DOS &#1074; 
  &#1053;&#1052;&#1051; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1089;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;
HIMEM.SYS.<br>
  &#1050;&#1072;&#1082; &#1074;&#1080;&#1076;&#1085;&#1086; &#1080;&#1079; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1096;&#1077; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1072;, &#1095;&#1072;&#1089;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; 
  &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1085;&#1077; &#1079;&#1072;&#1085;&#1103;&#1090;&#1072;&#1103; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; BIOS &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;&#1073;&#1091;&#1092;&#1077;&#1088;&#1072;&#1084;&#1080;, &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1081;. 
  &#1069;&#1090;&#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; &#1082; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; 
  (&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1085;&#1077; &#1082;&#1086; &#1074;&#1089;&#1077;&#1081;, &#1072; &#1083;&#1080;&#1096;&#1100; &#1082; &#1090;&#1086;&#1081; &#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1086;&#1073;&#1098;&#1077;&#1084; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089; &#1086;&#1073;&#1097;&#1080;&#1084; 
  &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1093; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;). &#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1085;&#1072; 
  &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; EMM386.EXE, &#1072; &#1089;&#1072;&#1084;&#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1080; 
  &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &quot;&#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077;&quot; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1081;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1073;&#1083;&#1086;&#1082;&#1072;&#1084;&#1080; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; 
  &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; (Upper Memory B10cks, UMB). MS-DOS &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1074; UMB &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; 
  &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1099; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; 
  &#1074; UMB &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090; &#1085;&#1080;&#1093; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;, &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1103; &#1077;&#1077; &#1090;&#1088;&#1072;&#1085;&#1079;&#1080;&#1090;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;. 
  &#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1074; UMB &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1086;&#1074; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;&#1072; CONFIG.SYS DEVICEHIGH 
  (&#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; DEVICE), &#1072; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1088;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; - &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; DOS 10ADHIGH. 
  &#1053;&#1072; &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1089;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1079;&#1072;&#1085;&#1103;&#1090;&#1099; &#1083;&#1080;&#1096;&#1100; 
  &#1086;&#1082;&#1086;&#1083;&#1086; 20...25 &#1050;&#1073;&#1072;&#1081;&#1090; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1072; &#1074;&#1089;&#1103; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1074; &#1086;&#1073;&#1098;&#1077;&#1084;&#1077; &#1086;&#1082;&#1086;&#1083;&#1086; 620 
  &#1050;&#1073;&#1072;&#1081;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;.</font></p>

</font>
</p>
<p>
&nbsp;
</p>
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index1.htm">
<img SRC="Back.gif" BORDER="0">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index3.htm">
<img SRC="For.gif" BORDER="0">
</a>
</font>
</td>
</tr>
</table>
</body>
</html>