<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<html>
<head>
<title>
</title>
<meta http-equiv="Content-Type" content="text/html;charset=windows-1251">
</head>
<body background="../FON.JPG" BGCOLOR="#E7E3E7" TEXT="#000000" LINK="#004080" VLINK="#004080">
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index2.htm">
<img SRC="Back.gif" BORDER="0">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index4.htm">
<img SRC="For.gif" BORDER="0">
</a>
</font>
</td>
</tr>
</table>
<p>
&nbsp;
</p>
<p align="center">
<font face="Arial, Helvetica, sans-serif" size="3">
<font size="4">
&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;
</font>
<br>
</font>
</p>
<p align="left">
<font face="Arial, Helvetica, sans-serif" size="3">

&#1050;&#1072;&#1082; &#1091;&#1078;&#1077; &#1086;&#1090;&#1084;&#1077;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1096;&#1077;, 
  &#1074; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;&#1093; &#1090;&#1080;&#1087;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
Pentium, &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1095;&#1072;&#1089;&#1090;&#1100; 
  (&#1084;&#1099; &#1085;&#1072;&#1079;&#1074;&#1072;&#1083;&#1080; &#1077;&#1077; &#1052;&#1055; 86), &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1080; 
  &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1091; 8086. &#1053;&#1080;&#1078;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; &quot;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&quot;, 
  &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1091; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1052;&#1055; 86.<br>
  &#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1076;&#1074;&#1077;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1100; 16-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;-&#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1084;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;, 
  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100; &#1074; &#1090;&#1088;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;: &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;-&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1080; 
  &#1080; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;. &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;-&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090; 
  &#1087;&#1086;&#1076; &#1086;&#1073;&#1097;&#1080;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &quot;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&quot;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1074;&#1093;&#1086;&#1076;&#1103;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; (&#1088;&#1080;&#1089;. 1.6).<br>
  &#1042; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1040;&#1061;, &#1042;&#1061;, &#1057;&#1061; &#1080;
DX. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090; 
  &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091; &#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1083;&#1102;&#1073;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; 
  (&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1083;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;) &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1076; &#1085;&#1080;&#1084;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; 
  &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1084; (&#1040;&#1053;, &#1042;&#1053;, &#1057;&#1053; &#1080;
DH) &#1080; &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1084; (AL, BL, 
  CL &#1080; DL) &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1072;&#1084;. &#1058;&#1072;&#1082;, &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;
  </p>
<blockquote>
<p align="left">
<font face="Arial, Helvetica, sans-serif" size="3">

<br>
<br>
  <font face="Verdana" size="3"><b>mov</b> BL, &#1040;&#1053;</font><br></font></p>
</blockquote>
<p align="left">
<br></font><font face="Arial, Helvetica, sans-serif" size="3">&#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090; 
  &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1081; &#1073;&#1072;&#1081;&#1090; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1040;&#1061; &#1074; &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1081; &#1073;&#1072;&#1081;&#1090; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1042;&#1061;, &#1085;&#1077; &#1079;&#1072;&#1090;&#1088;&#1072;&#1075;&#1080;&#1074;&#1072;&#1103; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; 
  &#1074;&#1090;&#1086;&#1088;&#1099;&#1093; &#1073;&#1072;&#1081;&#1090;&#1086;&#1074; &#1101;&#1090;&#1080;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;. &#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;-&#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1080;&#1082;, 
  &#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081; - .&#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;-&#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;, &#1090;.&#1077;. &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1082;&#1072;&#1082; &#1073;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; 
  &#1085;&#1072;&#1083;&#1077;&#1074;&#1086;.</p>
<p align="center"><img src="gl1-6.jpg"></p>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="3"><b>&#1056;&#1080;&#1089;. 1.6.
</b> &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;.</p>
<p><br>
  &#1042;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1099;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1077;&#1077; 
  &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084; &#1040;&#1061;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; 
  &#1084;&#1077;&#1089;&#1090;&#1072; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1040;&#1061; (&#1080;&#1083;&#1080; &#1077;&#1075;&#1086; 
  &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1072; AL). &#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1088;&#1103;&#1076; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; 
  &#1085;&#1077;&#1103;&#1074;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. &#1058;&#1072;&#1082;, &#1074;&#1089;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1094;&#1080;&#1082;&#1083;&#1086;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1057;&#1061; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082;&#1072; 
  &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1080;&#1081;; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1040;&#1061; &#1080; DX &#1074;&#1099;&#1089;&#1090;&#1091;&#1087;&#1072;&#1102;&#1090; 
  &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1085;&#1077;&#1103;&#1074;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074;; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1074;&#1086;&#1076;&#1072;-&#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 
  &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1040;&#1061; &#1080;&#1083;&#1080; AL &#1080; &#1090;.&#1076;.<br>
  &#1048;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; SI &#1080; DI &#1090;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; 
  &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1080;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; - &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099;, &#1080;&#1083;&#1080; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; 
  &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1073;&#1072;&#1079;&#1099; (&#1090;.&#1077;. &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072;) &#1087;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1080;&#1079; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. 
  &#1040;&#1076;&#1088;&#1077;&#1089; &#1073;&#1072;&#1079;&#1099; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1093; &#1042;&#1061; &#1080;&#1083;&#1080; &#1042;&#1056;. &#1057;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; 
  &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; SI &#1080; DI &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; 
  &#1085;&#1077;&#1103;&#1074;&#1085;&#1099;&#1093; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1074; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1093;.<br>
  &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1042;&#1056; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1073;&#1072;&#1079;&#1099; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074; &#1089;&#1090;&#1077;&#1082;&#1086;&#1074;&#1099;&#1093; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;&#1093;, 
  &#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; 
  &#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;.<br>
  &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1080;&#1079; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;-&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072;
SP, &#1089;&#1090;&#1086;&#1080;&#1090; &#1086;&#1089;&#1086;&#1073;&#1085;&#1103;&#1082;&#1086;&#1084; 
  &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1074; &#1090;&#1086;&#1084; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082;&#1072;&#1082; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; 
  &#1089;&#1090;&#1077;&#1082;&#1072; - &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1072; &#1085;&#1080;&#1078;&#1077;.<br>
  &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; SI, DI, BP &#1080; SP, &#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1085;&#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090; &#1087;&#1086;&#1073;&#1072;&#1081;&#1090;&#1086;&#1074;&#1091;&#1102; 
  &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1102;.<br>
  &#1063;&#1077;&#1090;&#1099;&#1088;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; CS, DS, ES &#1080; SS &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1080;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;, &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1103;, &#1082;&#1072;&#1082; &#1091;&#1078;&#1077; &#1086;&#1090;&#1084;&#1077;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1096;&#1077;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1102; 20-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1075;&#1086; 
  &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; 16-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074;. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1086; &#1085;&#1080;&#1093; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; 
  &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;.<br>
  &#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; IP &quot;&#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&quot; &#1079;&#1072; &#1093;&#1086;&#1076;&#1086;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1103; 
  &#1074; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1079;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081;. &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; 
  IP &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; (IP - &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1077;&#1075;&#1086; &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1072; &#1085;&#1077; &#1084;&#1085;&#1077;&#1084;&#1086;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; 
  &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1077; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;); &#1085;&#1072;&#1088;&#1072;&#1097;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074; &#1085;&#1077;&#1084; 
  &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;, &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1076;&#1083;&#1080;&#1085;&#1091; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074;, 
  &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;, &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1080;&#1079; &#1085;&#1080;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;
IP, &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1103; 
  &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1099; &#1074; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; &#1084;&#1099; &#1077;&#1097;&#1077; &#1074;&#1077;&#1088;&#1085;&#1077;&#1084;&#1089;&#1103; 
  &#1082; &#1088;&#1086;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; IP &#1074; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.<br>
  &#1056;&#1077;&#1075;&#1080;&#1089;&#1076;&#1088; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; (&#1077;&#1075;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; FLAGS), &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; (&#1088;&#1080;&#1089;. 1.7). &#1054;&#1085; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; 6 &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1080; 3 &#1073;&#1080;&#1090;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;&#1084; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;, &#1074;&#1087;&#1088;&#1086;&#1095;&#1077;&#1084;, &#1090;&#1086;&#1078;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1092;&#1083;&#1072;&#1075;&#1072;&#1084;&#1080;.</p>
<p align="center"><img src="gl1-7.jpg" ></p>
<p align="center"><font face="Arial, Helvetica, sans-serif" size="3"><b>&#1056;&#1080;&#1089;. 1.7.</b> &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;</font></p>
<p>&#1060;&#1083;&#1072;&#1075;&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1079;&#1072;&#1085;&#1086;&#1074;&#1086; 
  &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1080; &#1087;&#1086; 
  &#1085;&#1080;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1089;&#1091;&#1076;&#1080;&#1090;&#1100; &#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 
  &#1085;&#1077; &#1088;&#1072;&#1074;&#1077;&#1085; &#1083;&#1080; &#1077;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;, &#1085;&#1091;&#1083;&#1102;). &#1060;&#1083;&#1072;&#1075;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
  &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1090;&#1100; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. 
  &#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1092;&#1083;&#1072;&#1075;&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;.<br>
  &#1060;&#1083;&#1072;&#1075; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; CF (Carry Flag) &#1080;&#1085;&#1076;&#1080;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1080;&#1083;&#1080; &#1079;&#1072;&#1077;&#1084; &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; 
  &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;. &#1055;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1086;&#1084; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081;, 
  &#1074; &#1086;&#1073;&#1097;&#1077;&#1084;, &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1086;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; 16 &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1086;&#1074; &#1080;, 
  &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1080;&#1083;&#1080; &#1103;&#1095;&#1077;&#1081;&#1082;&#1091; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1055;&#1091;&#1089;&#1090;&#1100;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 
  &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1040;&#1061; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1086; 60000, &#1072; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1042;&#1061; - 40000. &#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; 
  &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;<br>
</p>
<blockquote>
<p><font size="3" face="Verdana">add AX,BX
  </font><br>
  </font></p>
</blockquote>
<p>&#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077;-&#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1080;&#1082;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;, 
  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1040;&#1061;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1095;&#1080;&#1089;&#1083;&#1086; 
  100000, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077;, &#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103;, &#1090;&#1072;&#1084; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; 
  &#1092;&#1083;&#1072;&#1075; CF, &#1087;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1077;&#1083; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1080;, &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, 
  &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1040;&#1061; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1074;&#1085;&#1086; 100000 - 65536 = 34464) &#1085;&#1077; 
  &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084;.<br>
  &#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;, &#1082;&#1072;&#1082; &#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1083;&#1102;&#1073;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1072;&#1103; 
  &#1087;&#1086; &#1093;&#1086;&#1076;&#1091; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1085;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1085;&#1080; &#1082; &#1082;&#1072;&#1082;&#1080;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1103;&#1084;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; 
  &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1092;&#1083;&#1072;&#1075;&#1072;. &#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1074; &#1092;&#1083;&#1072;&#1075;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1102; &#1084;&#1080;&#1089;&#1089;&#1080;&#1102; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081; 
  &#1080; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090; &#1082; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; 
  &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; 
  &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072; CF, &#1080; &#1087;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; &#1092;&#1083;&#1072;&#1075;&#1077; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1085;&#1072; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; 
  &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1101;&#1090;&#1086;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;. &#1058;&#1072;&#1082;&#1086;&#1081; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072;, 
  &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; jc (jump if
carry, &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1091;): </p>

<blockquote>
<p><font size="3" face="Verdana">add 
  AX.BX </font></p>

<p><font size="3" face="Verdana"><br>
  jc error ;B &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&nbsp; </font></p>

<p><font size="3" face="Verdana"> ;&#1085;&#1072; &#1084;&#1077;&#1090;&#1082;&#1091;&nbsp; </font></p>

<p><font size="3" face="Verdana"> error ;</font></p>

<p><font size="3" face="Verdana">&#1053;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1077; </font></p>

</blockquote>
<p><br>
  &#1057;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1087;&#1088;&#1072;&#1074;&#1077;&#1076;&#1083;&#1080;&#1074;&#1086; &#1087;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082;&#1086; &#1074;&#1089;&#1077;&#1084; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1099;&#1084; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;&#1084;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1102;&#1097;&#1080;&#1084; 
  &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, - &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1089;&#1072;&#1084;&#1072; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085;&#1072; &#1086;&#1090;&#1083;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1077; 
  &#1076;&#1083;&#1103; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;. &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; - &#1101;&#1090;&#1086; 
  &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1086; &#1087;&#1086;&#1076;&#1086;&#1079;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1086;&#1081; &#1090;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1080;&#1085;&#1086;&#1075;&#1086; &#1092;&#1083;&#1072;&#1075;&#1072;.<br>
  &#1060;&#1083;&#1072;&#1075; &#1087;&#1072;&#1088;&#1080;&#1090;&#1077;&#1090;&#1072; PF (Parity Flag) &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; 1, &#1077;&#1089;&#1083;&#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; 
  &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1095;&#1077;&#1090;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1093; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;, &#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1054;, &#1077;&#1089;&#1083;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1093; 
  &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1085;&#1077;&#1095;&#1077;&#1090;&#1085;&#1086;. &#1069;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1075; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1087;&#1088;&#1080; 
  &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1080;&#1072;&#1075;&#1085;&#1086;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;.<br>
  &#1060;&#1083;&#1072;&#1075; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; AF (Auxiliary Flag) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1093; 
  &#1085;&#1072;&#1076; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;-&#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080;. &#1054;&#1085; &#1080;&#1085;&#1076;&#1080;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1080;&#1083;&#1080; &#1079;&#1072;&#1077;&#1084; &#1080;&#1079; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1099; 
  (&#1073;&#1080;&#1090;&#1072; 4). &#1044;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;-&#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1082;&#1077; 
  &#1073;&#1072;&#1081;&#1090;&#1072; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1081; &#1094;&#1080;&#1092;&#1088;&#1099; &#1074; &#1074;&#1080;&#1076;&#1077; &#1077;&#1077; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1072;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; 
  &#1074; &#1073;&#1072;&#1081;&#1090;&#1077; &#1076;&#1074;&#1091;&#1093;&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1077; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1077; &#1086;&#1090; 0 &#1076;&#1086; 99
&#1044;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;-&#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1099;&#1077; 
  &#1095;&#1080;&#1089;&#1083;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1076;&#1083;&#1103; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1089; &#1080;&#1079;&#1084;&#1077;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1080;&#1073;&#1086;&#1088;&#1072;&#1084;&#1080;. 
  &#1044;&#1083;&#1103; &#1080;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1077; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085; &#1094;&#1077;&#1083;&#1099;&#1081; &#1088;&#1103;&#1076; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1087;&#1088;&#1080; 
  &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; 
  &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;. <br>
  &#1060;&#1083;&#1072;&#1075; &#1085;&#1091;&#1083;&#1103; ZF (Zero Flag) &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; 1, &#1077;&#1089;&#1083;&#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1074;&#1077;&#1085; 
  0. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1092;&#1083;&#1072;&#1075; ZF &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1079; 5 &#1074;&#1099;&#1095;&#1077;&#1089;&#1090;&#1100; 5 &#1080;&#1083;&#1080; &#1082; 10 &#1087;&#1088;&#1080;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; -10.<br>
  &#1060;&#1083;&#1072;&#1075; &#1079;&#1085;&#1072;&#1082;&#1072; SF (Sign Rag) &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1082; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1103;&#1089;&#1100; 
  &#1074; 1 &#1087;&#1088;&#1080; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077;. &#1050;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;, &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; 
  &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090; &#1095;&#1080;&#1089;&#1083;&#1072; &#1073;&#1077;&#1079; &#1079;&#1085;&#1072;&#1082;&#1072;, &#1090;.&#1077;. &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077;, &#1080; &#1095;&#1080;&#1089;&#1083;&#1072; &#1089;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;, 
  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1082;&#1072;&#1082; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1090;&#1072;&#1082; &#1080; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;. &#1055;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; 
  &#1095;&#1080;&#1089;&#1083;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1081; &#1073;&#1080;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; (&#1073;&#1080;&#1090; 15 &#1076;&#1083;&#1103; &#1089;&#1083;&#1086;&#1074; &#1080;&#1083;&#1080; &#1073;&#1080;&#1090; 
  7 &#1076;&#1083;&#1103; &#1073;&#1072;&#1081;&#1090;&#1086;&#1074;). &#1060;&#1083;&#1072;&#1075; SF &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; 
  &#1089;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1095;&#1080;&#1089;&#1083;&#1086; &#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1084; &#1073;&#1080;&#1090;&#1086;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, S000h &#1080;&#1083;&#1080;
FFFFh.<br>
  &#1060;&#1083;&#1072;&#1075; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; OF (Overflow Rag) &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1090;.&#1077;. &#1074;&#1099;&#1093;&#1086;&#1076; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; 
  &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086;&#1075;&#1086; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; &#1095;&#1080;&#1089;&#1077;&#1083; &#1089;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;. &#1042; &#1079;&#1085;&#1072;&#1082;&#1086;&#1074;&#1086;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; 
  &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0000h &#1076;&#1086; 7FFFh &#1089;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1072; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; S000h &#1076;&#1086;
FFFFh, 
  &#1090;.&#1077;. &#1095;&#1080;&#1089;&#1083;&#1072; &#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1084; &#1073;&#1080;&#1090;&#1086;&#1084; - &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;. &#1060;&#1083;&#1072;&#1075; OF &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, 
  &#1077;&#1089;&#1083;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1076;&#1074;&#1091;&#1093; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1089;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;, &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1102;&#1097;&#1080;&#1081; 
  7FFFh (&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; S000h, &#1080;&#1076;&#1091;&#1090; &#1091;&#1078;&#1077; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;), &#1080;&#1083;&#1080; &#1087;&#1088;&#1080; &#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1080; 
  &#1080;&#1079; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1089;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;, &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1081; S000h (&#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1090;&#1072;&#1082;&#1080;&#1077; 
  &#1095;&#1080;&#1089;&#1083;&#1072; &#1089;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;). &#1055;&#1086;&#1079;&#1078;&#1077; &#1101;&#1090;&#1086;&#1090; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085; &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;.<br>
  &#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1077;&#1084; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1082; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1084; &#1092;&#1083;&#1072;&#1075;&#1072;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; 
  &#1074;&#1089;&#1077;&#1075;&#1086; &#1090;&#1088;&#1080;.<br>
  &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1092;&#1083;&#1072;&#1075; &#1090;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; (&#1083;&#1086;&#1074;&#1091;&#1096;&#1082;&#1080;) TF (Trace
Rag) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; 
  &#1087;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1045;&#1089;&#1083;&#1080; TF=1, &#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
  &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084; 1, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; 
  &#1087;&#1086; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; 04. &#1069;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1075; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; &#1086;&#1090;&#1083;&#1072;&#1076;&#1095;&#1080;&#1082;&#1086;&#1074;, 
  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1083;&#1072;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1086; &#1096;&#1072;&#1075;&#1072;&#1084; &#1080;&#1083;&#1080; &#1089; &#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080; 
  &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1072;.<br>
  &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1092;&#1083;&#1072;&#1075; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; IF (Interrupt
Rag) &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090; (&#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1074;&#1077;&#1085; 
  1) &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1077;&#1090; (&#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1074;&#1077;&#1085; 0) &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1091; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; 
  &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;. &#1058;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1089;&#1086;&#1073;&#1086; &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; 
  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1073;&#1077;&#1079; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1086;&#1084;&#1077;&#1093;.<br>
  &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1092;&#1083;&#1072;&#1075; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; DF (Direction Rag) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; 
  &#1089;&#1090;&#1088;&#1086;&#1082;. &#1045;&#1089;&#1083;&#1080; DF=0, &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084;
&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;, &#1086;&#1090; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1093; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; &#1082; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;; &#1077;&#1089;&#1083;&#1080;
DF=1, &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1076;&#1077;&#1090; 
  &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1092;&#1083;&#1072;&#1075;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1087;&#1088;&#1080; 
  &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;.<br>
  &#1044;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1089;&#1073;&#1088;&#1086;&#1089;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; &#1086;&#1089;&#1086;&#1073;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; 
  sti (set interrupt, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;) &#1080;&#1083;&#1080; cli (clear
interrupt, &#1089;&#1073;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; 
  &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;). 
  </font>
</p>
<p>
&nbsp;
</p>
<table COLS="3" WIDTH="16%">
<tr>
<td>
<font face="Arial, Helvetica, sans-serif">
<a href="Index2.htm">
<img SRC="Back.gif" BORDER="0">
</a>
</font>
</td>
<td WIDTH="10%">
<font face="Arial, Helvetica, sans-serif">
<a href="../index.html">
<img SRC="Menu.gif" BORDER="0">
</a>
</font>
</td>
<td ALIGN="RIGHT">
<font face="Arial, Helvetica, sans-serif">
<a href="Index4.htm">
<img SRC="For.gif" BORDER="0">
</a>
</font>
</td>
</tr>
</table>
</body>
</html>
